package tzb.utils;

import java.util.ArrayList;
import java.util.Random;

public class RandomSource {
    public String[] randomName(int N) {
        ArrayList<String> list = new ArrayList<String>();
        String[] surnames = {
                "赵", "钱", "孙", "李", "周", "吴", "郑", "王", "冯", "陈",
                "褚", "卫", "蒋", "沈", "韩", "杨", "朱", "秦", "尤", "许",
                "何", "吕", "施", "张", "孔", "曹", "严", "华", "金", "魏",
                "陶", "姜", "戚", "谢", "邹", "喻", "柏", "水", "窦", "章",
                "云", "苏", "潘", "葛", "奚", "范", "彭", "郎", "鲁", "韦",
                "昌", "马", "苗", "凤", "花", "方", "俞", "任", "袁", "柳",
                "酆", "鲍", "史", "唐", "费", "廉", "岑", "薛", "雷", "贺",
                "倪", "汤", "滕", "殷", "罗", "毕", "郝", "邬", "安", "常",
                "乐", "于", "时", "傅", "皮", "卞", "齐", "康", "伍", "余",
                "元", "卜", "顾", "孟", "平", "黄", "和", "穆", "萧", "尹"
        };
        String[] names = {
                "靖", "铭", "琛", "川", "承", "司", "斯", "宗", "骁",
                "聪", "在", "钩", "锦", "铎", "楚", "铮", "钦", "则",
                "真", "心", "新", "悦", "西", "兮", "楚", "初", "千",
                "锐", "素", "锦", "静", "镜", "斯", "舒", "瑜", "童",
                "楠", "景", "茗", "聿", "启", "尧", "言", "嘉", "桉",
                "桐", "筒", "竹", "林", "乔", "栋", "家", "翊", "松",
                "楠", "景", "茗", "聿", "启", "尧", "言", "嘉", "桉",
                "桐", "筒", "竹", "林", "乔", "栋", "家", "翊", "松",
                "清", "澈", "泫", "浚", "润", "泽", "向", "凡", "文",
                "浦", "洲", "珩", "玄", "洋", "淮", "雨", "子", "云",
                "妍", "澜", "淇", "沐", "潆", "盈", "雨", "文", "冰",
                "雯", "溪", "子", "云", "汐", "潞", "淇", "妙", "涵",
                "卓", "昱", "南", "晨", "知", "宁", "年", "易", "晗",
                "炎", "焕", "哲", "煦", "旭", "明", "阳", "朗", "典",
                "灿", "夏", "珞", "煊", "晴", "彤", "诺", "宁", "恬",
                "钧", "灵", "昭", "琉", "晨", "曦", "南", "毓", "冉",
                "辰", "宸", "野", "安", "为", "亦", "围", "岚", "也",
                "以", "延", "允", "容", "恩", "衡", "宇", "硕", "已",
                "意", "也", "坤", "辰", "伊", "米", "安", "恩", "以",
                "容", "宛", "岚", "又", "衣", "亚", "悠", "允", "画"
        };
        int m = surnames.length;
        int n = names.length;
        Random random = new Random();
        for(int i = 0; i < N; i += 1) {
            int l = random.nextInt(2) + 2;
            String str = surnames[random.nextInt(m)];
            if(l == 3) {
                str += names[random.nextInt(n)] + names[random.nextInt(n)];
            } else if(l == 2) {
                str += names[random.nextInt(n)];
            }
            list.add(str);
        }
        return list.toArray(new String[0]);
    }
    public String[] randomPwd(int N) {
        ArrayList<String> list = new ArrayList<String>();
        Random random = new Random();
        for(int i = 0; i < N; i += 1) {
            String str = "";
            for(int j = 0; j < 6; j += 1) {
                str += (char)(97 + random.nextInt(26));
            }
            list.add(str);
        }
        return list.toArray(new String[0]);
    }
}
